In [2]:
import numpy as np
import pandas as pd
data = pd.Series([0, 1, 2 , 3, np.nan, 4, 5, 6])
data.isnull()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
dtype: bool

In [3]:
data.notnull()

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
dtype: bool

In [4]:
data.dropna()

0    0.0
1    1.0
2    2.0
3    3.0
5    4.0
6    5.0
7    6.0
dtype: float64

In [5]:
data

0    0.0
1    1.0
2    2.0
3    3.0
4    NaN
5    4.0
6    5.0
7    6.0
dtype: float64

In [6]:
not_null_data = data.dropna()
not_null_data

0    0.0
1    1.0
2    2.0
3    3.0
5    4.0
6    5.0
7    6.0
dtype: float64

In [7]:
data.dropna(inplace = True)
data

0    0.0
1    1.0
2    2.0
3    3.0
5    4.0
6    5.0
7    6.0
dtype: float64

In [8]:
data_dim = pd.DataFrame([[1,2,3,np.nan], [4,5,np.nan,np.nan], [7,np.nan,np.nan,np.nan], [np.nan,np.nan,np.nan,np.nan]])
data_dim

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [9]:
data_dim.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [10]:
data_dim.dropna(how = 'all')

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN

In [11]:
data_dim.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  NaN
3  NaN  NaN  NaN

In [13]:
data_dim.dropna(axis = 1, thresh = 2)

     0    1
0  1.0  2.0
1  4.0  5.0
2  7.0  NaN
3  NaN  NaN

In [14]:
data_dim.dropna(thresh = 2)

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN

In [17]:
data_dim_fill = data_dim.fillna(0)
data_dim_fill

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  4.0  5.0  0.0  0.0
2  7.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0

In [18]:
data_dim_fill = data_dim.fillna({0: 1, 1: 2, 2: 8, 3: 11})
data_dim_fill

     0    1    2     3
0  1.0  2.0  3.0  11.0
1  4.0  5.0  8.0  11.0
2  7.0  2.0  8.0  11.0
3  1.0  2.0  8.0  11.0

In [19]:
data_dim_fill = data_dim.fillna(method='ffill')
data_dim_fill

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  5.0  3.0 NaN
3  7.0  5.0  3.0 NaN

In [20]:
data_dim_fill = data_dim.fillna(method='ffill', limit = 2)
data_dim_fill

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  5.0  3.0 NaN
3  7.0  5.0  NaN NaN

In [21]:
data_dim_fill = data_dim.fillna(axis = 1, method='ffill')
data_dim_fill

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  4.0  5.0  5.0  5.0
2  7.0  7.0  7.0  7.0
3  NaN  NaN  NaN  NaN

In [22]:
data_dim

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [23]:
data_dim_fill = data_dim.fillna(data_dim.mean())
data_dim_fill

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  3.5  3.0 NaN
3  4.0  3.5  3.0 NaN

In [24]:
data = pd.Series([1,2,-99,4,5,-99,7,8,-99])
data

0     1
1     2
2   -99
3     4
4     5
5   -99
6     7
7     8
8   -99
dtype: int64

In [25]:
data.replace(-99, np.nan)

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
5    NaN
6    7.0
7    8.0
8    NaN
dtype: float64

In [26]:
new_data = pd.Series([-100, 11, 12, 13])
combined_series = pd.concat([data, new_data], ignore_index = True)
combined_series

0       1
1       2
2     -99
3       4
4       5
5     -99
6       7
7       8
8     -99
9    -100
10     11
11     12
12     13
dtype: int64

In [27]:
data_replaced = combined_series.replace([-99, -100], np.nan)
data_replaced

0      1.0
1      2.0
2      NaN
3      4.0
4      5.0
5      NaN
6      7.0
7      8.0
8      NaN
9      NaN
10    11.0
11    12.0
12    13.0
dtype: float64

In [28]:
data_replaced = combined_series.replace({-99: np.nan, -100: 0})
data_replaced

0      1.0
1      2.0
2      NaN
3      4.0
4      5.0
5      NaN
6      7.0
7      8.0
8      NaN
9      0.0
10    11.0
11    12.0
12    13.0
dtype: float64

In [31]:
data_number = pd.DataFrame({'english': ['zero','one','two','three','four','five'],
'digits': [0,1,2,3,4,5]})
data_number

  english  digits
0    zero       0
1     one       1
2     two       2
3   three       3
4    four       4
5    five       5

In [32]:
data_number['multiple'] = data_number['english'].map(english_to_multiple)
data_number

  english  digits multiple
0    zero       0      NaN
1     one       1      NaN
2     two       2      yes
3   three       3      NaN
4    four       4      yes
5    five       5      NaN

In [35]:
import random
data = random.sample(range(1, 99), 50)
data

[70,
 92,
 78,
 45,
 91,
 32,
 10,
 90,
 65,
 86,
 49,
 33,
 13,
 18,
 42,
 61,
 44,
 95,
 27,
 73,
 5,
 68,
 8,
 60,
 25,
 67,
 74,
 59,
 55,
 54,
 66,
 52,
 35,
 85,
 64,
 6,
 76,
 62,
 39,
 87,
 89,
 34,
 43,
 48,
 2,
 30,
 56,
 16,
 93,
 77]

In [36]:
bucket = [1, 25, 35, 60, 80, 100]
cut_data = pd.cut(data, bucket)
cut_data

[(60, 80], (80, 100], (60, 80], (35, 60], (80, 100], ..., (25, 35], (35, 60], (1, 25], (80, 100], (60, 80]]
Length: 50
Categories (5, interval[int64]): [(1, 25] < (25, 35] < (35, 60] < (60, 80] < (80, 100]]

In [37]:
data = pd.Series(list('abcdababcdabcd'))
data

0     a
1     b
2     c
3     d
4     a
5     b
6     a
7     b
8     c
9     d
10    a
11    b
12    c
13    d
dtype: object

In [38]:
pd.get_dummies(data)

    a  b  c  d
0   1  0  0  0
1   0  1  0  0
2   0  0  1  0
3   0  0  0  1
4   1  0  0  0
5   0  1  0  0
6   1  0  0  0
7   0  1  0  0
8   0  0  1  0
9   0  0  0  1
10  1  0  0  0
11  0  1  0  0
12  0  0  1  0
13  0  0  0  1